Documents/Лео_ЗаявкаНаЗапчасти/Лео_ЗаявкаНаЗапчасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ЗаявкаНаЗапчасти</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>CatalogRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Лео_основанияЗаказаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Паллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортныхКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныеЗатраиы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗапчастей</name>
    <type>
      <types>CatalogRef.Лео_ВидЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>Цехзаказчик</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительЦеха</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельПриобретения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Лео_оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеЛинии</name>
      <type>
        <types>CatalogRef.Лео_ОборудованиеЛиний</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Documents/Лео_ЗаявкаНаЗапчасти/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СоздатьСписаниеТоваров(Команда)
	Если Объект.Проведен тогда
		Если НЕ Объект.Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке тогда
			Сообщить("Создания документа ""Списание товаров"" возможно только из статуса ""К отгрузке""");
			Возврат;
		КонецЕсли;
		
		Парам = новый Структура; 
		Парам.Вставить("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.СписаниеТоваров.Форма.ФормаДокумента",Парам);
	Иначе
		Сообщить ("Документ не проведен");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ЗаполнитьТабличнуюЧастьТовары(Истина) ;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьТовары(ОчищатьТабличнуюЧасть = Истина) Экспорт
	
	Если ОчищатьТабличнуюЧасть Тогда
		Если Объект.Товары.Количество()>0 Тогда
			Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.Товары.Очистить();
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите файл загрузки";
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлEXCEL = Диалог.ВыбранныеФайлы[0];
	
	ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ФайлEXCEL, Ложь, 26);
	
	ЗаполнитьТабличнуюЧастьЗаказа( ТабЗнач ,ОчищатьТабличнуюЧасть);
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьМетодом_ExcelApplication(Знач ИмяФайла, ПерваяСтрокаЗаголовки = Истина, НачалоСтрокДанных = 26)
	
	Перем оЕ, Книга, Лист;                  
	
	// создаем объект Excel
	Попытка
		оЕ = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Ошибка запуска Excel!");
		оЕ = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
	// открываем файл
	Попытка
		Книга = оЕ.Workbooks.Open(ИмяФайла);
	Исключение
		Сообщить("Ошибка открытия файла "+ИмяФайла+"!");
		Книга = Неопределено;
		оЕ.Quit();
		оЕ = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
	// получаем данные листа 1
	Попытка
		Лист = Книга.Worksheets(1);
		//КоличествоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		КоличествоСтрок = 200;

		КоличествоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		Для Сч = 1 По КоличествоКолонок Цикл
			Если ПерваяСтрокаЗаголовки Тогда
				Колонка = ТаблицаРезультат.Колонки.Добавить(Строка(Лист.Cells(НачалоСтрокДанных-1,Сч).Value));
				Колонка.Заголовок = Строка(Лист.Cells(НачалоСтрокДанных-1,Сч).Value);
			Иначе
				Колонка = ТаблицаРезультат.Колонки.Добавить("Колонка"+СтрЗаменить(Строка(Сч),Символы.НПП,""));
			КонецЕсли;
		КонецЦикла;
		
		ПерваяСтрока = НачалоСтрокДанных;
		
		МассивДанных = Лист.Range(Лист.Cells(ПерваяСтрока,1),Лист.Cells(КоличествоСтрок,КоличествоКолонок)).Value.Unload();
		
		Лист = Неопределено;
		Книга = Неопределено;
		оЕ.Quit();
		оЕ = Неопределено;
		
		Для Сч = ПерваяСтрока По КоличествоСтрок Цикл
			ТаблицаРезультат.Добавить();
		КонецЦикла;
		
		Для Сч = 0 По КоличествоКолонок-1 Цикл
			ТаблицаРезультат.ЗагрузитьКолонку(МассивДанных[Сч],Сч);
		КонецЦикла;
		
		Возврат ТаблицаРезультат;
	Исключение
		Сообщить("Ошибка загрузки данных!");
		Лист = Неопределено;
		Книга = Неопределено;
		оЕ.Quit();
		оЕ = Неопределено;
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗаказа( ТабЗнач ,ОчищатьТабличнуюЧасть);

	Для каждого СтрокаТЧ из ТабЗнач цикл
		Артикул = СокрЛП(СтрЗаменить(Строка(СтрокаТЧ.Колонка10)," ",""));
		Если НЕ Артикул = "" Тогда 
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
			Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.Номенклатура 	= Номенклатура;
				НоваяСтрока.Количество 		= Число(СтрокаТЧ.Колонка14);
				НоваяСтрока.Цена			= ПолучитьЦену(Номенклатура);
				НоваяСтрока.Сумма			= НоваяСтрока.Количество * НоваяСтрока.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦену (Номенклатура);
	
	
	Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура,,Объект.ТипЦен, Объект.Дата,,, 1, 1);

	//Рассчитывается = Объект.ТипЦен.Рассчитывается;
	//
	//Если Рассчитывается Тогда 
	//	БазовыйТипЦен	= Объект.ТипЦен.БазовыйТипЦен;
	//Иначе
	//	БазовыйТипЦен   = Объект.ТипЦен;
	//КонецЕсли;	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ЦеныНоменклатурыСрезПоследних.Цена
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	//	|			,
	//	|			ТипЦен = &ТипЦен
	//	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";

	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("ТипЦен", БазовыйТипЦен);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Цена = ВыборкаДетальныеЗаписи.Цена;
	//КонецЦикла;

	Возврат Цена	
	
КонецФункции

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	 ЗаполнитьЦеныТабличнуюЧасть( );
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЦеныТабличнуюЧасть( );
    СуммаДок = 0;
	Для каждого СтрокаТЧ из Объект.Товары цикл
		СтрокаТЧ.Цена			= ПолучитьЦену(СтрокаТЧ.Номенклатура);
		СтрокаТЧ.Сумма			= СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		СуммаДок = СуммаДок+СтрокаТЧ.Сумма; 
	КонецЦикла;
	Объект.СуммаДокумента = СуммаДок;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ОбновитьДанныеПоТЧ ();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоТЧ ()
	СуммаТЧ = 0;
	Для каждого СтрокаТч из  Объект.Товары цикл
		СуммаТЧ = СуммаТЧ + СтрокаТЧ.Сумма;	
	КонецЦикла;
	Объект.СуммаДокумента = СуммаТЧ;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	//ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(Элементы.Товары.ТекущиеДанные, Объект);
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения) И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " не выбрана единица измерения цены!
				                 |Пересчет количества невозможен.");
		
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмеренияМест) Тогда
			ТекущаяСтрока.КоличествоМест = 0;
		Иначе
			Если ТекущаяСтрока.Коэффициент = 0 И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " у единицы измерения цены "
					                 + СокрЛП(ТекущаяСтрока.ЕдиницаИзмерения) + " не проставлен коэффициент!
					                 |Пересчет количества невозможен.");
			ИначеЕсли ТекущаяСтрока.ЕдиницаИзмеренияМест.Коэффициент = 0 И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " у единицы измерения мест "
					                 + СокрЛП(ТекущаяСтрока.ЕдиницаИзмеренияМест) + " не проставлен коэффициент!
					                 |Пересчет количества невозможен.");
			Иначе
				//Расчет количества в единицах измерения мест - КоличествоМест				 
                ЕдиницаИзмеренияМест = ТекущаяСтрока.ЕдиницаИзмеренияМест;
				Если ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзмеренияМест Тогда
					КоличествоМест = ТекущаяСтрока.Количество;
				Иначе
					КоличествоМест = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент / ТекущаяСтрока.ЕдиницаИзмеренияМест.Коэффициент;
				КонецЕсли;
				
				//Если Цел(КоличествоМест)<>КоличествоМест Тогда	
				//	СтрокаТабличнойЧасти.КоличествоМест = КоличествоМест;
				//КонецЕсли;
				ТекущаяСтрока.КоличествоМест = КоличествоМест;
			КонецЕсли;
		КонецЕсли;
	ПересчитатьСумму ();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияМестПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ТекущаяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		ТекущаяСтрока.Коэффициент      = ТекущаяСтрока.ЕдиницаИзмерения.Коэффициент;
		ТекущаяСтрока.ЕдиницаИзмеренияМест = ТекущаяСтрока.Номенклатура.ЕдиницаИзмеренияМест;
		Если ЗначениеЗаполнено(Объект.ТипЦен) Тогда
			ТекущаяСтрока.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(ТекущаяСтрока.Номенклатура,,Объект.ТипЦен, Объект.Дата,,, 1, 1);
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСумму ();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму ()
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.количество * ТекущаяСтрока.Цена;
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьПеремещениеТоваров(Команда)
	Если Объект.Проведен тогда
		Если НЕ Объект.Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке тогда
			Сообщить("Создания документа ""Списание товаров"" возможно только из статуса ""К отгрузке""");
			Возврат;
		КонецЕсли;
		
		Парам = новый Структура; 
		Парам.Вставить("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.ПеремещениеТоваров.Форма.ФормаДокумента",Парам);
	Иначе
		Сообщить ("Документ не проведен");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОприходованиеТоваров(Команда)
		Если Объект.Проведен тогда
		Если НЕ Объект.Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке тогда
			Сообщить("Создания документа ""Оприходование товаров"" возможно только из статуса ""К отгрузке""");
			Возврат;
		КонецЕсли;
		
		Парам = новый Структура; 
		Парам.Вставить("Основание",Объект.Ссылка);
		ОткрытьФорму("Документ.ОприходованиеТоваров.Форма.ФормаДокумента",Парам);
	Иначе
		Сообщить ("Документ не проведен");
	КонецЕсли;

КонецПроцедуры



&НаСервере
Функция ПечатьЗаявкиНасервере()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ТабДокумент = ЭтотОбъект.ПечатьЗаявки();
    ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");

	возврат ТабДокумент
	
	//ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	// Вставить содержимое обработчика.
	ТабДокумент = ПечатьЗаявкиНасервере();

	
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, ложь, ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект.Ссылка, Объект.Ссылка.Метаданные().Представление()), Объект.Ссылка);

	
КонецПроцедуры

&НаКлиенте
Процедура ЦехзаказчикПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ПредставительЦеха=Объект.Цехзаказчик.абс_ПользовательОтветственный;
КонецПроцедуры
